// 二级指针2.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
    int a[4][5]; int n, k; double avg, sum = 0;
    printf("请输入20个数组元素：");
    for (n = 0;n < 4;n++)
    {
        for (k = 0;k < 5;k++)
        {
            scanf_s("%d", &a[n][k]);
        }
    }
    int* p[5];
    p[0] = a[0];p[1] = a[1];p[2] = a[2];p[3] = a[3];
    int** pp = p;
    int max =a[0][0];
    int min =a[0][1];
    for (n = 0;n < 4;n++)
    {
        for (k = 0;k < 5;k++)
        {
            if (*(*(pp + n) + k) > max)
            {
                max = *(*(pp + n) + k);
            }
            if (*(*(pp + n) + k) < min)
            {
                min = *(*(pp + n) + k);
            }
            sum = sum + *(*(pp + n) + k);
        }
    }
    printf("最大数为：%d ", max);
    printf("最小数为：%d ", min);
    avg = sum / 20;
    printf("平均数为：%lf ", avg);

}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
